using System;

namespace refHomeWrk
{
    class Program
    {
            //Написать метод Resize изменяющий количество элементов массива(метод должен иметь возможсть увеличить или уменьшить количество элментов массива)


            //Написать методы для добавления эелмента в начало массива, в конец массива и по указанному индексу

            //написать методы для удаления первого элемента массива, последнего элемента массива и элемента по указанному индексу.

        static void Main(string[] args)
        {
            
        }
    }
}
